Reports/СостояниеГабаритныхЧертежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>СостояниеГабаритныхЧертежей</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/СостояниеЗамера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СостояниеЗамера</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусЗамера</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗамера</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектЗамера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
						<v8:Type>cfg:CatalogRef.ГабаритныеЧертежи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектИзменения</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ПроверитьГабаритныеЧертежи</v8:Type>
						<v8:Type>cfg:DocumentRef.АктПриемкиПомещения</v8:Type>
						<v8:Type>cfg:DocumentRef.АктПриемкиГабаритныхЧертежей</v8:Type>
						<v8:Type>cfg:CatalogRef.ГабаритныеЧертежи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПлановаяГотовностьГабаритныхЧертежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПлановаяГотовностьГабаритныхЧертежей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаГотовности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГабаритныйЧертеж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГабаритныеЧертежи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПлановаяГотовностьПомещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПлановаяГотовностьПомещений</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаГотовности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ВыездНаЗамер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ВыездНаЗамер</Name>
			<BasedOn>
				<xr:Item>Document.ЗаявкаНаЗамер</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыездаПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыездаФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаИсполнителю</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаЗамер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СокращенноеНазвание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГабаритныеЧертежи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГабаритныйЧертеж</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГабаритныеЧертежи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗамерПроизведен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Помещение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Исполнители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПричинаИзменени</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПредыдущая</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаИзменения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ГабаритныеЧертежи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ГабаритныеЧертежи</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дизайнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодельГотоваАвтор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодельГотоваДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Помещения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Помещение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Помещения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Помещения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеБезКода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>45</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПомещения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяСтадия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтадииБитрикса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/СостояниеГабаритныхЧертежей/Forms/ФормаОтчета/Ext/Form/Module.bsl
Процедура СделкаПриИзмененииНаСервере()
	
	ПолеВывода.Очистить();
	
	Если НЕ ЗначениеЗаполнено(Проект) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Если ТипОтчета = 0 Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	МАКСИМУМ(СостояниеЗамера.Период) КАК Период,
			|	СостояниеЗамера.ОбъектЗамера КАК ОбъектЗамера
			|ПОМЕСТИТЬ вт
			|ИЗ
			|	РегистрСведений.СостояниеЗамера КАК СостояниеЗамера
			|ГДЕ
			|	СостояниеЗамера.ОбъектЗамера.Проект = &Проект
			|
			|СГРУППИРОВАТЬ ПО
			|	СостояниеЗамера.ОбъектЗамера
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СостояниеЗамераСрезПоследних.ОбъектЗамера КАК ОбъектЗамера,
			|	СостояниеЗамераСрезПоследних.СтатусЗамера КАК СтатусЗамера,
			|	ЕСТЬNULL(ПлановаяГотовностьГабаритныхЧертежей.ДатаГотовности, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаГотовности,
			|	СостояниеЗамераСрезПоследних.ОбъектЗамера.Наименование КАК Наименование,
			|	СостояниеЗамераСрезПоследних.ОбъектИзменения КАК ОбъектИзменения,
			|	ВЫРАЗИТЬ(ВыездНаЗамерГабаритныеЧертежи.Ссылка.Комментарий КАК СТРОКА(100)) КАК Комментарий,
			|	ЕСТЬNULL(МАКСИМУМ(ВыездНаЗамерГабаритныеЧертежи.Ссылка.ДатаВыездаФакт), ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаВыездаФакт,
			|	ЕСТЬNULL(ВыездНаЗамерГабаритныеЧертежи.Ссылка.Ссылка, НЕОПРЕДЕЛЕНО) КАК Выезд,
			|	ЕСТЬNULL(ВыездНаЗамерГабаритныеЧертежи.Ссылка.СокращенноеНазвание, """") КАК СокращенноеНазвание,
			|	ЕСТЬNULL(СоздатьМодельГабаритногоЧертежа.ДатаСоздания, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаМодели
			|ИЗ
			|	РегистрСведений.СостояниеЗамера.СрезПоследних КАК СостояниеЗамераСрезПоследних
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановаяГотовностьГабаритныхЧертежей КАК ПлановаяГотовностьГабаритныхЧертежей
			|		ПО СостояниеЗамераСрезПоследних.ОбъектЗамера = ПлановаяГотовностьГабаритныхЧертежей.ГабаритныйЧертеж
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВыездНаЗамер.ГабаритныеЧертежи КАК ВыездНаЗамерГабаритныеЧертежи
			|		ПО ((ВЫРАЗИТЬ(СостояниеЗамераСрезПоследних.ОбъектЗамера КАК Справочник.ГабаритныеЧертежи)) = ВыездНаЗамерГабаритныеЧертежи.ГабаритныйЧертеж)
			|			И (ВыездНаЗамерГабаритныеЧертежи.Ссылка.Проведен)
			|			И (ВыездНаЗамерГабаритныеЧертежи.ЗамерПроизведен)
			|		ЛЕВОЕ СОЕДИНЕНИЕ Задача.СоздатьМодельГабаритногоЧертежа КАК СоздатьМодельГабаритногоЧертежа
			|		ПО СостояниеЗамераСрезПоследних.ОбъектЗамера = СоздатьМодельГабаритногоЧертежа.ГабаритныйЧертеж
			|			И (СоздатьМодельГабаритногоЧертежа.Выполнена)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт КАК вт
			|		ПО СостояниеЗамераСрезПоследних.ОбъектЗамера = вт.ОбъектЗамера
			|			И СостояниеЗамераСрезПоследних.Период = вт.Период
			|ГДЕ
			|	ТИПЗНАЧЕНИЯ(СостояниеЗамераСрезПоследних.ОбъектЗамера) = ТИП(Справочник.ГабаритныеЧертежи)
			|	И НЕ ЕСТЬNULL(СостояниеЗамераСрезПоследних.ОбъектЗамера.ЭтоГруппа, ЛОЖЬ)
			|
			|СГРУППИРОВАТЬ ПО
			|	ЕСТЬNULL(ПлановаяГотовностьГабаритныхЧертежей.ДатаГотовности, ДАТАВРЕМЯ(1, 1, 1)),
			|	СостояниеЗамераСрезПоследних.СтатусЗамера,
			|	СостояниеЗамераСрезПоследних.ОбъектЗамера,
			|	ВыездНаЗамерГабаритныеЧертежи.Ссылка.Ссылка,
			|	СостояниеЗамераСрезПоследних.Период,
			|	СостояниеЗамераСрезПоследних.ОбъектИзменения,
			|	СостояниеЗамераСрезПоследних.ОбъектЗамера.Наименование,
			|	ВЫРАЗИТЬ(СостояниеЗамераСрезПоследних.ОбъектИзменения.Комментарий КАК СТРОКА(100)),
			|	ЕСТЬNULL(ВыездНаЗамерГабаритныеЧертежи.Ссылка.СокращенноеНазвание, """"),
			|	ВЫРАЗИТЬ(ВыездНаЗамерГабаритныеЧертежи.Ссылка.Комментарий КАК СТРОКА(100)),
			|	СоздатьМодельГабаритногоЧертежа.ДатаСоздания
			|
			|УПОРЯДОЧИТЬ ПО
			|	Наименование";
		
		
	Иначе
	
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СостояниеЗамераСрезПоследних.ОбъектЗамера КАК ОбъектЗамера,
			|	СостояниеЗамераСрезПоследних.СтатусЗамера КАК СтатусЗамера,
			|	ЕСТЬNULL(ПлановаяГотовностьПомещений.ДатаГотовности, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаГотовности,
			|	СостояниеЗамераСрезПоследних.ОбъектЗамера.Наименование КАК Наименование,
			|	СостояниеЗамераСрезПоследних.ОбъектИзменения КАК ОбъектИзменения,
			|	ВЫРАЗИТЬ(ВыездНаЗамерГабаритныеЧертежи.Ссылка.Комментарий КАК СТРОКА(100)) КАК Комментарий,
			|	ЕСТЬNULL(МАКСИМУМ(ВыездНаЗамерГабаритныеЧертежи.Ссылка.ДатаВыездаФакт), ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаВыездаФакт,
			|	ЕСТЬNULL(ВыездНаЗамерГабаритныеЧертежи.Ссылка.Ссылка, НЕОПРЕДЕЛЕНО) КАК Выезд,
			|	ЕСТЬNULL(ВыездНаЗамерГабаритныеЧертежи.Ссылка.СокращенноеНазвание, """") КАК СокращенноеНазвание
			|ИЗ
			|	РегистрСведений.СостояниеЗамера.СрезПоследних КАК СостояниеЗамераСрезПоследних
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановаяГотовностьПомещений КАК ПлановаяГотовностьПомещений
			|		ПО СостояниеЗамераСрезПоследних.ОбъектЗамера = ПлановаяГотовностьПомещений.Помещение
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВыездНаЗамер.ГабаритныеЧертежи КАК ВыездНаЗамерГабаритныеЧертежи
			|		ПО ((ВЫРАЗИТЬ(СостояниеЗамераСрезПоследних.ОбъектЗамера КАК Справочник.Помещения)) = ВыездНаЗамерГабаритныеЧертежи.Помещение)
			|			И (ВыездНаЗамерГабаритныеЧертежи.Ссылка.Проведен)
			|			И (ВыездНаЗамерГабаритныеЧертежи.ЗамерПроизведен)
			|ГДЕ
			|	СостояниеЗамераСрезПоследних.ОбъектЗамера.Проект = &Проект
			|	И ТИПЗНАЧЕНИЯ(СостояниеЗамераСрезПоследних.ОбъектЗамера) = ТИП(Справочник.Помещения)
			|	И НЕ ЕСТЬNULL(СостояниеЗамераСрезПоследних.ОбъектЗамера.ЭтоГруппа, ЛОЖЬ)
			|
			|СГРУППИРОВАТЬ ПО
			|	ЕСТЬNULL(ПлановаяГотовностьПомещений.ДатаГотовности, ДАТАВРЕМЯ(1, 1, 1)),
			|	СостояниеЗамераСрезПоследних.СтатусЗамера,
			|	СостояниеЗамераСрезПоследних.ОбъектЗамера,
			|	ВыездНаЗамерГабаритныеЧертежи.Ссылка.Ссылка,
			|	СостояниеЗамераСрезПоследних.Период,
			|	СостояниеЗамераСрезПоследних.ОбъектИзменения,
			|	СостояниеЗамераСрезПоследних.ОбъектЗамера.Наименование,
			|	ВЫРАЗИТЬ(СостояниеЗамераСрезПоследних.ОбъектИзменения.Комментарий КАК СТРОКА(100)),
			|	ЕСТЬNULL(ВыездНаЗамерГабаритныеЧертежи.Ссылка.СокращенноеНазвание, """"),
			|	ВЫРАЗИТЬ(ВыездНаЗамерГабаритныеЧертежи.Ссылка.Комментарий КАК СТРОКА(100))
			|
			|УПОРЯДОЧИТЬ ПО
			|	Наименование";
	
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Проект", Проект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Макет = Отчеты.СостояниеГабаритныхЧертежей.ПолучитьМакет("Макет");
	
	Область = Макет.ПолучитьОбласть("Шапка");
	Область.Параметры.Загаловок = "Состояние замеров " + ?(ТипОтчета = 0, "габаритных чертежей.", "помещений.");
	
	ПолеВывода.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("Строка");
	
	Пока Выборка.Следующий() Цикл
		
    	Область.Параметры.Заполнить(Выборка);	
		
		ПолеВывода.Вывести(Область);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КоманднаяПанельФормыБыстрыеОтборы(Элемент) экспорт
Сообщить(ЭтаФорма.ТекущийЭлемент.Имя);
КонецПроцедуры        

&НаКлиенте
Процедура СделкаПриИзменении(Элемент)
	СделкаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТипОтчетаПриИзменении(Элемент)
	СделкаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СкрытьРасшифровку(Команда)
	Элементы.ГруппаРасшифровка.Видимость = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.ГруппаРасшифровка.Видимость = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПолеВыводаОбработкаДополнительнойРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	ТипРасшифровки = ТипЗнч(Расшифровка);
	
	Если ТипРасшифровки = Тип("СправочникСсылка.ГабаритныеЧертежи") ИЛИ ТипРасшифровки = Тип("СправочникСсылка.Помещения") Тогда
	
		СтандартнаяОбработка = Ложь;
		ВывестиРасшифровку(Расшифровка);
	
	КонецЕсли;
КонецПроцедуры

Процедура ВывестиРасшифровку(Расшифровка)

	Элементы.ГруппаРасшифровка.Видимость = Истина;
	ПолеРасшифровки.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостояниеЗамера.Период КАК Дата,
		|	СостояниеЗамера.ОбъектИзменения КАК Документ,
		|	СостояниеЗамера.СтатусЗамера КАК Статус,
		|	ЕСТЬNULL(СостояниеЗамера.ОбъектИзменения.Комментарий, """") КАК Комментарий
		|ИЗ
		|	РегистрСведений.СостояниеЗамера КАК СостояниеЗамера
		|ГДЕ
		|	СостояниеЗамера.ОбъектЗамера = &ОбъектЗамера
		|
		|УПОРЯДОЧИТЬ ПО
		|	СостояниеЗамера.Период";
	
	Запрос.УстановитьПараметр("ОбъектЗамера", Расшифровка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Макет = Отчеты.СостояниеГабаритныхЧертежей.ПолучитьМакет("Расшифровка");
	
	Область = Макет.ПолучитьОбласть("Шапка");
	Область.Параметры.ОбъектЗамера = Расшифровка;
	
	ПолеРасшифровки.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("Строка");

	Пока Выборка.Следующий() Цикл
		Область.Параметры.Заполнить(Выборка);	
		ПолеРасшифровки.Вывести(Область);
	КонецЦикла;
	
КонецПроцедуры
